### Local tests
```
$ terraform plan
var.serviceregistry_api
  Service registry API endpoint to test against

  Enter a value: 
```

With Production `serviceregistry API endpoint` the following results are produced:
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.s3_test_bucket_with_app.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_with_app.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_different_region.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_acl_grants.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_different_region.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_acl_grants.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_with_team.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_encryption.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_encryption.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_with_team.module.ownership.data.http.service_owner: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_test_acl_grants.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-acl-grants"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket, please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + grant {
          + permissions = [
              + "READ",
            ]
          + type        = "Group"
          + uri         = "http://acs.amazonaws.com/groups/global/AllUsers"
        }
      + grant {
          + permissions = [
              + "READ_ACP",
              + "WRITE",
            ]
          + type        = "Group"
          + uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery"
        }
      + grant {
          + id          = "some_aws_canonic_user_id"
          + permissions = [
              + "FULL_CONTROL",
            ]
          + type        = "CanonicalUser"
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_different_region.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-different-region"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket, please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_encryption.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-encryption"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket, please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_with_app.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-with-app-tag"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "app"       = "echo"
          + "concern"   = "This is a test bucket, please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_with_team.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-with-team-tag"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket, please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```